bricks/ejudge/ejudge.html
<div class="Page">

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Список контестов с задачами для самостоятельного решения</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Изучение языка программирования</h3>
<div class="outline-text-3" id="text-1-1">
<table>


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">Ввод/вывод, арифметические операции</td>
<td class="left"><a href="http://ejudge.oplab.org/01-firststeps/statements.html">Условия</a></td>
<td class="left"><a href="http://ejudge.oplab.org/cgi-bin/new-client?contest_id=000003&locale_id=1">Вход</a></td>
</tr>

<tr>
<td class="left">Условный оператор <code>if</code></td>
<td class="left"><a href="http://ejudge.oplab.org/02-if/statements.html">Условия</a></td>
<td class="left"><a href="http://ejudge.oplab.org/cgi-bin/new-client?contest_id=000004&locale_id=1">Вход</a></td>
</tr>

<tr>
<td class="left">Циклы - 1</td>
<td class="left"><a href="http://ejudge.oplab.org/03-loops/statements.html">Условия</a></td>
<td class="left"><a href="http://ejudge.oplab.org/cgi-bin/new-client?contest_id=000007&locale_id=1">Вход</a></td>
</tr>

<tr>
<td class="left">Циклы - 2</td>
<td class="left"><a href="http://ejudge.oplab.org/04-loops/statements.html">Условия</a></td>
<td class="left"><a href="http://ejudge.oplab.org/cgi-bin/new-client?contest_id=000008&locale_id=1">Вход</a></td>
</tr>

<tr>
<td class="left">Вложенные циклы</td>
<td class="left"><a href="http://ejudge.oplab.org/05-nested-loops/statements.html">Условия</a></td>
<td class="left"><a href="http://ejudge.oplab.org/cgi-bin/new-client?contest_id=000009&locale_id=1">Вход</a></td>
</tr>

<tr>
<td class="left">Одномерные массивы</td>
<td class="left"><a href="http://ejudge.oplab.org/06-arrays-1d/statements.html">Условия</a></td>
<td class="left"><a href="http://ejudge.oplab.org/cgi-bin/new-client?contest_id=000010&locale_id=1">Вход</a></td>
</tr>

<tr>
<td class="left">Строки - 1</td>
<td class="left"><a href="http://ejudge.oplab.org/08-strings/statements.html">Условия</a></td>
<td class="left"><a href="http://ejudge.oplab.org/cgi-bin/new-client?contest_id=000043&locale_id=1">Вход</a></td>
</tr>

<tr>
<td class="left">Алгоритмы сортировки</td>
<td class="left"><a href="http://ejudge.oplab.org/07-sorting/statements.html">Условия</a></td>
<td class="left"><a href="http://ejudge.oplab.org/cgi-bin/new-client?contest_id=000024&locale_id=1">Вход</a></td>
</tr>

<tr>
<td class="left">Порождение комбинаторных объектов</td>
<td class="left"><a href="http://ejudge.oplab.org/09-enumeration/statements.html">Условия</a></td>
<td class="left"><a href="http://ejudge.oplab.org/cgi-bin/new-client?contest_id=000044&locale_id=1">Вход</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Региональные этапы Всероссийской олимпиады по информатике</h3>
<div class="outline-text-3" id="text-1-2">
<table>


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">Региональный этап РОИ 2012/2013</td>
<td class="left">Условия: <a href="http://ejudge.oplab.org/regional/2013-day1.doc">день 1</a> <a href="http://ejudge.oplab.org/regional/2013-day2.doc">день 2</a></td>
<td class="left"><a href="http://ejudge.oplab.org/cgi-bin/new-client?contest_id=32&amp;locale_id=1">Вход</a></td>
</tr>

<tr>
<td class="left">Региональный этап РОИ 2011/2012</td>
<td class="left">Условия: <a href="http://ejudge.oplab.org/regional/2012-day1.doc">день 1</a> <a href="http://ejudge.oplab.org/regional/2012-day2.doc">день 2</a></td>
<td class="left"><a href="http://ejudge.oplab.org/cgi-bin/new-client?contest_id=33&amp;locale_id=1">Вход</a></td>
</tr>

<tr>
<td class="left">Региональный этап РОИ 2010/2011</td>
<td class="left">Условия: <a href="http://ejudge.oplab.org/regional/2011-day1.doc">день 1</a> <a href="http://ejudge.oplab.org/regional/2011-day2.doc">день 2</a></td>
<td class="left"><a href="http://ejudge.oplab.org/cgi-bin/new-client?contest_id=34&amp;locale_id=1">Вход</a></td>
</tr>

<tr>
<td class="left">Региональный этап РОИ 2009/2010</td>
<td class="left">Условия: <a href="http://ejudge.oplab.org/regional/2010-day1.doc">день 1</a> <a href="http://ejudge.oplab.org/regional/2010-day2.doc">день 2</a></td>
<td class="left"><a href="http://ejudge.oplab.org/cgi-bin/new-client?contest_id=35&amp;locale_id=1">Вход</a></td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3">Ёjik</h3>
<div class="outline-text-3" id="text-1-3">
<table>


<colgroup>
<col  class="left">

<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">Осень 2013</td>
<td class="left">Условия: <a href="http://school.oplab.org/olymp/ejik/2013-statements.pdf">pdf</a></td>
<td class="left"><a href="http://ejudge.oplab.org/cgi-bin/new-client?contest_id=28&amp;locale_id=1">Вход</a></td>
</tr>

<tr>
<td class="left">Весна 2014</td>
<td class="left">Условия: <a href="http://school.oplab.org/olymp/ejik/2014s-statements.pdf">pdf</a></td>
<td class="left"><a href="http://ejudge.oplab.org/cgi-bin/new-client?contest_id=48&amp;locale_id=1">Вход</a></td>
</tr>

<tr>
<td class="left">Осень 2014</td>
<td class="left">Условия: <a href="http://school.oplab.org/olymp/ejik/2014a-statements.pdf">pdf</a></td>
<td class="left"><a href="http://ejudge.oplab.org/cgi-bin/new-client?contest_id=49&amp;locale_id=1">Вход</a></td>
</tr>
</tbody>
</table>

</div>
</div>
</div>
</div>
